Revit 2027 API
FabricationConfiguration.GetFabricationConnectorDomain Method
 Gets the fabrication connector domain from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorDomainType GetFabricationConnectorDomain(
	int fabricationConnectorId
)
Public Function GetFabricationConnectorDomain (
	fabricationConnectorId As Integer
) As ConnectorDomainType
public:
ConnectorDomainType GetFabricationConnectorDomain(
	int fabricationConnectorId
)
member GetFabricationConnectorDomain :
        fabricationConnectorId : int -> ConnectorDomainType
Parameters
fabricationConnectorId Int32
 The fabrication connector identifier.
Return Value
ConnectorDomainType
 The fabrication connector's domain.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace